In [1]:
import pandas as pd

In [2]:
pd.read_excel(r'C:\Users\Tikam Singh Nayal\Desktop\MYEXCELDATA.xlsx')

    Name  Roll No Present
0  Sumit        8       Y

In [3]:
pd.read_csv(r'C:\Users\Tikam Singh Nayal\Desktop\MyCSVData.csv')

    Name  Class Grade
0  Vijay      6     O
1  Allen      7     A

In [7]:
pd.read_csv(r'C:\Users\Tikam Singh Nayal\Desktop\MyTSVData.tsv', sep='\t')

     Name  Roll No Grade
0  Deepak        1    A+
1  Vishal        2     O